from random import randint, seed
from lab5 import task_multiple_linear
from lab5 import task_logical

"""
Выберу ли я книгу из художественной литературы для прочтения? Параметры выбора:
1) Рейтинг: 0-5☆
2) Сюжет книги: шаблонный (0), оригинальный (1)
3) Жанр: драма (0), ужасы (1), фентези (2), фантастика (3)
4) Автор: не нравится (0), неизвестен (1), нравится (2)
5) Стиль повествования автора: нудный (0), захватывающий внимание (1)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------7) Грамотность автора: больно читать (0), хорошо или нормально (1)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------5) Краткое писание: посредственное (0), интригующее (1)

Результаты: ищу другую книгу (0), читаю эту (1)

Пример элемента выборки X: [5, 1, 5, 2, 0, 1, 0] и соответствующий ему результат выборки y: [0].

Если объединить в одно, получится так: 
[5, 1, 5, 2, 0, 1, 0, 0]
"""

"""
data = [[0, 0, 1, 2, 1, 0], [0, 1, 0, 0, 0, 0], [0, 1, 2, 2, 0, 0],
            [0, 1, 2, 0, 1, 0], [1, 1, 0, 0, 0, 0], [1, 0, 0, 2, 0, 0],
            [0, 1, 1, 2, 1, 0], [1, 0, 0, 1, 0, 0], [0, 0, 0, 2, 1, 0],
            [1, 1, 0, 1, 0, 0], [1, 1, 1, 2, 1, 1], [1, 1, 1, 2, 1, 1],
            [0, 0, 1, 1, 0, 0], [0, 0, 1, 0, 0, 0], [0, 0, 1, 1, 1, 0],
            [1, 1, 1, 2, 1, 1], [1, 1, 2, 0, 1, 0], [0, 1, 1, 0, 0, 0],
            [1, 1, 2, 1, 1, 1], [1, 0, 2, 2, 0, 0], [1, 1, 0, 1, 0, 0],
            [1, 1, 0, 1, 0, 0], [0, 0, 2, 0, 0, 0], [0, 1, 2, 0, 0, 0],
            [1, 0, 1, 0, 0, 0], [1, 0, 0, 0, 0, 0], [0, 1, 0, 1, 1, 0],
            [1, 1, 0, 2, 1, 0], [1, 0, 2, 0, 1, 0], [1, 1, 2, 2, 0, 0]]



[[4, 1, 2, 1, 1, 1], [4, 1, 0, 1, 0, 0], [1, 0, 3, 1, 0, 0], [3, 0, 1, 1, 0, 0], [2, 1, 1, 0, 1, 0],
            [2, 0, 2, 1, 0, 0], [4, 0, 3, 0, 0, 0], [5, 1, 1, 0, 1, 0], [2, 0, 0, 0, 0, 0], [2, 1, 1, 0, 0, 0],
            [2, 0, 3, 0, 0, 0], [5, 1, 2, 1, 0, 1], [5, 0, 2, 1, 0, 1], [1, 0, 0, 1, 1, 0], [5, 1, 0, 1, 1, 0],
            [1, 0, 0, 0, 0, 0], [1, 0, 2, 0, 1, 0], [1, 0, 1, 1, 0, 0], [5, 0, 0, 0, 1, 0], [5, 1, 3, 1, 1, 1],
            [3, 1, 0, 1, 0, 0], [3, 0, 3, 0, 0, 0], [5, 0, 0, 1, 1, 0], [4, 1, 3, 0, 0, 1], [5, 1, 3, 1, 1, 1],
            [2, 0, 1, 0, 1, 0], [5, 0, 1, 1, 0, 0], [1, 1, 3, 0, 1, 0], [3, 0, 3, 1, 1, 0], [5, 0, 2, 0, 0, 0],
            [3, 0, 3, 0, 1, 0], [4, 0, 3, 1, 1, 1], [1, 1, 2, 0, 1, 0], [4, 0, 1, 1, 1, 1], [1, 0, 1, 0, 1, 0],
            [4, 1, 0, 1, 0, 0], [4, 0, 1, 1, 1, 0], [1, 1, 3, 0, 1, 0], [2, 0, 3, 0, 1, 0], [3, 0, 2, 1, 0, 1],
            [1, 0, 1, 0, 0, 0], [4, 1, 3, 1, 0, 1], [3, 0, 1, 0, 0, 0], [2, 0, 2, 0, 0, 0], [4, 1, 3, 0, 0, 1],
            [5, 0, 2, 1, 1, 1], [2, 0, 2, 1, 1, 0], [1, 0, 0, 0, 0, 0], [2, 1, 3, 1, 1, 0], [3, 1, 1, 0, 0, 0]]
"""

def solve():
    # r_i = [rating, books_plot, genre, author, narrative_style, i_read], data = [r_0, r_1, ..., r_i, ..., r_(n-1)]
    data = [[4, 1, 0, 1, 1, 1], [2, 0, 2, 0, 1, 0], [1, 0, 0, 1, 0, 0], [2, 0, 2, 1, 0, 0], [2, 1, 0, 1, 1, 0],
            [5, 1, 2, 0, 1, 1], [5, 0, 3, 1, 0, 1], [3, 0, 3, 0, 0, 0], [2, 1, 3, 0, 0, 0], [4, 1, 2, 0, 0, 0],
            [5, 0, 3, 1, 0, 1], [4, 1, 3, 0, 0, 1], [4, 1, 2, 0, 1, 0], [3, 1, 1, 0, 0, 0], [1, 0, 2, 1, 1, 0],
            [2, 0, 0, 0, 0, 0], [3, 1, 3, 1, 1, 1], [5, 1, 2, 1, 1, 1], [2, 0, 3, 1, 0, 0], [1, 0, 1, 1, 1, 0],
            [4, 1, 0, 1, 1, 1], [2, 0, 2, 0, 1, 0], [1, 0, 0, 1, 0, 0], [2, 0, 2, 1, 0, 0], [2, 1, 0, 1, 1, 0],
            [5, 1, 2, 0, 1, 0], [5, 0, 3, 1, 0, 1], [3, 0, 3, 0, 0, 0], [2, 1, 3, 0, 0, 0], [4, 1, 2, 0, 0, 0],
            [5, 0, 3, 1, 0, 1], [4, 1, 3, 0, 0, 0], [4, 1, 2, 0, 1, 0], [3, 1, 1, 0, 0, 0], [1, 0, 2, 1, 1, 0],
            [2, 0, 0, 0, 0, 0], [3, 1, 3, 1, 1, 0], [5, 1, 2, 1, 1, 1], [2, 0, 3, 1, 0, 0], [1, 0, 1, 1, 1, 0],
            [2, 1, 0, 1, 0, 0], [2, 1, 3, 1, 1, 0], [2, 0, 0, 1, 0, 0], [3, 0, 0, 1, 1, 0], [4, 0, 1, 0, 0, 0],
            [4, 0, 1, 1, 1, 0], [2, 0, 3, 0, 0, 0], [4, 1, 2, 0, 0, 0], [1, 0, 1, 0, 0, 0], [5, 0, 2, 1, 0, 1]]

    num_task = int(input("1 - Множественный линейный регрессионный анализ \n2 - Логистический регрессионный анализ \n3 - сгенерировать выборку из 30 значений\nЧто запустить? \n"))
    match num_task:
        case (1):
            task_multiple_linear.solve(data)
        case (2):
            task_logical.solve(data)
        case(3):
            n = int(input("\nСколько значений сгенерировать?\n"))
            make_data(n)

def make_data(n):
    data = []
    for i in range(n):
        seed(i)

        rating = randint(1, 5)
        book_s_plot = randint(0, 1)
        genre = randint(0, 3)
        author = randint(0, 1)
        narrative_style = randint(0, 1)
        #author_s_literacy = randint(0, 1)
        #description = randint(0, 1)

        print(f"{i + 1}. Рейтинг: {rating}/5, Сюжет: {book_s_plot}/1, Жанр: {genre}/3, Автор: {author}/1, Стиль письма: {narrative_style}/1")
        answer = int(input("Будешь читать книгу? "))

        data.append([rating, book_s_plot, genre, author, narrative_style, answer])

    print(data)